Revit 2024 API
ExternalResourceServerUtils Class
 Contains utilities related to external resource server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class ExternalResourceServerUtils
Visual Basic
Public NotInheritable Class ExternalResourceServerUtils
Visual C++
public ref class ExternalResourceServerUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceServerUtils
See Also
ExternalResourceServerUtils Members
Autodesk.Revit.DB Namespace